app/controllers/swaps_controller.rb

SELECT "swaps".* FROM "swaps"
---
  def index
    @swaps = Swap.all

INSERT INTO "swaps" ("game_id", "ticket_id", "status", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["game_id", 1], ["ticket_id", 1], ["status", "pending"], ["comment", "aaaaaa"], ["created_at", 2016-10-26 18:43:21 UTC], ["updated_at", 2016-10-26 18:43:21 UTC]]
---
  def create
    @swap = Swap.new(swap_params)

    if @swap.save

UPDATE "swaps" SET "status" = $1, "updated_at" = $2 WHERE "swaps"."id" = $3  [["status", "accepted"], ["updated_at", 2016-10-27 18:35:29 UTC], ["id", 1]]
---
  def update
    if @swap.update(swap_params)

SELECT  "swaps".* FROM "swaps" WHERE "swaps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_swap
      @swap = Swap.find(params[:id])