app/controllers/tickets_controller.rb

  def create
    @ticket = current_user.tickets.new(ticket_params)

    if @ticket.save
---
INSERT INTO "tickets" ("user_id", "club", "image", "value", "family_enclosure", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"